# Lesson 4 Practice: Pandas Part 2

Use this notebook to follow along with the lesson in the corresponding lesson notebook: [L04-Pandas_Part2-Lesson.ipynb](./L04-Pandas_Part2-Lesson.ipynb).

## Instructions
Follow along with the teaching material in the lesson. Throughout the tutorial sections labeled as "Tasks" are interspersed and indicated with the icon: ![Task](http://icons.iconarchive.com/icons/sbstnblnd/plateau/16/Apps-gnome-info-icon.png). You should follow the instructions provided in these sections by performing them in the practice notebook.  When the tutorial is completed you can turn in the final practice notebook. For each task, use the cell below it to write and test your code.  You may add additional cells for any task as needed or desired.

## Task 1a: Setup

- import pandas
- re-create the `df` data frame
- re-create the `iris_df` data frame

In [54]:
import pandas as pd
import numpy as np
iris_df = pd.read_csv('data/iris.csv')
df = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})

In [55]:
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [56]:
df

   alpha beta
0      0    a
1      1    b
2      2    c
3      3    d
4      4    e

## Task 2a: Inserting Columns

+ Create a copy of the `df` dataframe.
+ Add a new column named "delta" to the copy that consists of random numbers.

In [57]:
df_copy = df.copy()
df_copy

   alpha beta
0      0    a
1      1    b
2      2    c
3      3    d
4      4    e

In [58]:
df_copy['delta'] = pd.Series(np.random.random(5))
df_copy

   alpha beta     delta
0      0    a  0.754714
1      1    b  0.600573
2      2    c  0.339550
3      3    d  0.404586
4      4    e  0.799253

## Task 3a: Missing Data

+ Create two new copies of the `df` dataframe:
+ Add a new column to both that has missing values.
+ In one copy, replace missing values with a value of your choice.
+ In the other copy, drop rows with `NaN` values.
+ Print both arrays to confirm.

In [59]:
df

   alpha beta
0      0    a
1      1    b
2      2    c
3      3    d
4      4    e

In [60]:
df_1 = df.copy()
df_2 = df.copy()
df_1["gamma"] = pd.Series(np.random.random(3))
df_2["theta"] = pd.Series(np.random.random(4))

print(df_1)
print(df_2)

   alpha beta     gamma
0      0    a  0.743384
1      1    b  0.443883
2      2    c  0.689954
3      3    d       NaN
4      4    e       NaN
   alpha beta     theta
0      0    a  0.960494
1      1    b  0.568747
2      2    c  0.840640
3      3    d  0.333001
4      4    e       NaN

In [61]:
df_1.fillna(0,inplace=True)
df_2.dropna(inplace=True)

In [62]:
print(df_1)
print(df_2)

   alpha beta     gamma
0      0    a  0.743384
1      1    b  0.443883
2      2    c  0.689954
3      3    d  0.000000
4      4    e  0.000000
   alpha beta     theta
0      0    a  0.960494
1      1    b  0.568747
2      2    c  0.840640
3      3    d  0.333001

## Task 4a: Operations
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

View the [Computational tools](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html) and [statistical methods](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#method-summary) documentation.
Using the list of operational functions choose five functions to use with the iris data frame.

In [63]:
# less than 
iris_df.lt(iris_df).head()

# greater than
iris_df.gt(iris_df).head()

# add 
iris_df.add(iris_df).head()

# correlation - column wise
iris_df.corr()
iris_df["sepal_length"].corr(iris_df["sepal_width"])

# covariance
iris_df.cov()

iris_df["sepal_length"].cov(iris_df["sepal_width"])

-0.03926845637583891

## Task 4b:  Apply

Practice using `apply` on either the `df` or `iris_df` data frames using any two functions of your choice other than `print`, `type`, and `np.sum`.

In [64]:
# Finding the minimum in each column. Looked only at the columns having numeric values 
# args =() takes the parameters for the 'func' 
# Here, 0 is specified since numpy.min flattens the array if the axis is not specified

print(iris_df.iloc[:,0:4].apply(np.min,args=(0)))
print(iris_df.iloc[:,0:4].apply(np.max,args=(0)))

sepal_length    4.3
sepal_width     2.0
petal_length    1.0
petal_width     0.1
dtype: float64
sepal_length    7.9
sepal_width     4.4
petal_length    6.9
petal_width     2.5
dtype: float64

## Task 4c.  Occurances
Ientify the number of occurances for each species (virginica, versicolor, setosa) in the `iris_df` object.  *Hint*: the `value_counts` function only works on a `pd.Series` object, not on the full data frame..

In [65]:
iris_df["species"].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

## Task 5a: String Methods

+ Create a list of five strings that represent dates in the form YYYY-MM-DD (e.g. 2020-02-20 for Feb 20th, 2020).
+ Add this list of dates as a new column in the `df` dataframe.
+ Now split the date into 3 new columns with one column representing the year, another the month and another they day.
+ Combine the values from columns `alpha` and `beta` into a new column where the values are spearated with a colon.

In [66]:
date_list=["2022-02-20","2022-02-21","2022-02-22","2022-02-23","2022-02-24"]
date_list

df["dates"]=date_list
df

#df["dates"].str


df["year"],df["month"],df["day"] = df["dates"].str.split('-').str
df

# This CANNOT be done since alpha has integers and beta has strings
# df["concat"] = df["alpha"] + ':' + df["beta"]

C:\Users\Oruganti\AppData\Local\Temp\ipykernel_15756\3980073417.py:10: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  df["year"],df["month"],df["day"] = df["dates"].str.split('-').str

   alpha beta       dates  year month day
0      0    a  2022-02-20  2022    02  20
1      1    b  2022-02-21  2022    02  21
2      2    c  2022-02-22  2022    02  22
3      3    d  2022-02-23  2022    02  23
4      4    e  2022-02-24  2022    02  24

## Task 6a: Concatenation by Rows
+ Create the following dataframe
```Python
df1 = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
```
+ Create a new dataframe named `df2` with column names "delta" and "gamma" that contins 5 rows with some index names that overlap with the `df1` dataframe and some that do not.
+ Concatenate the two dataframes by rows and print the result.
+ You should see the two have combined one after the other, but there should also be missing values added. 
+ Explain why there are missing values.

In [75]:
df1 = pd.DataFrame(
  {'alpha': [0, 1, 2, 3, 4],
   'beta': ['a', 'b', 'c', 'd', 'e']}, index = ['I1', 'I2' ,'I3', 'I4', 'I5'])
df1

df2 = pd.DataFrame({'delta':[10,20,30,40,50],'gamma':['q','r','s','t','u']}, index = ['I1','J1','I2','J2','I3'])
df2

pd.concat([df1,df2])

    alpha beta  delta gamma
I1    0.0    a    NaN   NaN
I2    1.0    b    NaN   NaN
I3    2.0    c    NaN   NaN
I4    3.0    d    NaN   NaN
I5    4.0    e    NaN   NaN
I1    NaN  NaN   10.0     q
J1    NaN  NaN   20.0     r
I2    NaN  NaN   30.0     s
J2    NaN  NaN   40.0     t
I3    NaN  NaN   50.0     u

## Task 6b: Concatenation by Columns

Using the same dataframes, df1 and df2, from Task 6a practice:
+ Concatenate the two by columns
+ Add a "delta" column to `df1` and concatenate by columns such that there are 5 columns in the merged dataframe.
+ Respond in writing to this question (add a new 'raw' cell to contain your answer). What will happen if using you had performed an inner join while concatenating?  
+ Try the concatenation with the inner join to see if you are correct.

In [80]:
df1["delta"]=[100,200,300,400,500]
df1

pd.concat([df1,df2],axis=1)
pd.concat([df1,df2],axis=1,join="inner")

    alpha beta  delta  delta gamma
I1      0    a    100     10     q
I2      1    b    200     30     s
I3      2    c    300     50     u

#### Task 6c: Concat and append data frames
<span style="float:right; margin-left:10px; clear:both;">![Task](./media/task-icon.png)</span>

+ Create a new 5x5 dataframe full of random numbers.
+ Create a new 5x10 dataframe full of 1's.
+ Append one to the other and print it.
+ Append a single Series of zeros to the end of the appended dataframe.

In [89]:
df5 = pd.DataFrame(np.random.random((5,5)))
df5

df6 = pd.DataFrame(np.ones((5,10)))
df6

df7 = df5.append(df6,ignore_index=True)
print(df7)

df7.append(pd.Series(np.zeros(10)),ignore_index=True)

          0         1         2         3         4    5    6    7    8    9
0  0.119118  0.544745  0.126665  0.106148  0.581077  NaN  NaN  NaN  NaN  NaN
1  0.555897  0.684038  0.435131  0.096243  0.394045  NaN  NaN  NaN  NaN  NaN
2  0.423350  0.504186  0.208872  0.646232  0.871133  NaN  NaN  NaN  NaN  NaN
3  0.159930  0.802856  0.106049  0.595630  0.884692  NaN  NaN  NaN  NaN  NaN
4  0.817392  0.293325  0.083674  0.003587  0.802061  NaN  NaN  NaN  NaN  NaN
5  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
6  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
7  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
8  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
9  1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0

C:\Users\Oruganti\AppData\Local\Temp\ipykernel_15756\3912399659.py:7: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df7 = df5.append(df6,ignore_index=True)
C:\Users\Oruganti\AppData\Local\Temp\ipykernel_15756\3912399659.py:10: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df7.append(pd.Series(np.zeros(10)),ignore_index=True)

           0         1         2         3         4    5    6    7    8    9
0   0.119118  0.544745  0.126665  0.106148  0.581077  NaN  NaN  NaN  NaN  NaN
1   0.555897  0.684038  0.435131  0.096243  0.394045  NaN  NaN  NaN  NaN  NaN
2   0.423350  0.504186  0.208872  0.646232  0.871133  NaN  NaN  NaN  NaN  NaN
3   0.159930  0.802856  0.106049  0.595630  0.884692  NaN  NaN  NaN  NaN  NaN
4   0.817392  0.293325  0.083674  0.003587  0.802061  NaN  NaN  NaN  NaN  NaN
5   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
6   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
7   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
8   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
9   1.000000  1.000000  1.000000  1.000000  1.000000  1.0  1.0  1.0  1.0  1.0
10  0.000000  0.000000  0.000000  0.000000  0.000000  0.0  0.0  0.0  0.0  0.0

## Task 6d: Grouping

Demonstrate a `groupby`.

+ Create a new column with the label "region" in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'. Use these randomly.
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add a `dev_stage` column by randomly selecting from the values "early" and "late".
+ Use `groupby` to get a new data frame of means for each species,in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.

In [100]:
iris_df.head()

iris_df['region'] = np.random.choice(['Southeast','Northeast','Midwest','Northwest','Southwest'],iris_df.shape[0])
iris_df.sample(5)

iris_df.groupby(['species','region']).mean()

iris_df['dev_stage'] = np.random.choice(['late','early'],iris_df.shape[0])
iris_df.sample(5)

iris_df.groupby(['species','region','dev_stage']).mean()

iris_df.groupby(['species','region','dev_stage']).count()

                                sepal_length  sepal_width  petal_length  \
species    region    dev_stage
setosa     Midwest   early                 5            5             5
                     late                  6            6             6
           Northeast early                 2            2             2
                     late                  4            4             4
           Northwest early                 5            5             5
                     late                  6            6             6
           Southeast early                 6            6             6
                     late                  6            6             6
           Southwest early                 5            5             5
                     late                  5            5             5
versicolor Midwest   early                 4            4             4
                     late                  7            7             7
           Northeast early                 8            8             8
                     late                  6            6             6
           Northwest early                 2            2             2
                     late                  4            4             4
           Southeast early                 2            2             2
                     late                  4            4             4
           Southwest early                 6            6             6
                     late                  7            7             7
virginica  Midwest   early                 4            4             4
                     late                  6            6             6
           Northeast early                 7            7             7
                     late                  8            8             8
           Northwest early                 4            4             4
                     late                  2            2             2
           Southeast early                 7            7             7
                     late                  1            1             1
           Southwest early                 8            8             8
                     late                  3            3             3

                                petal_width
species    region    dev_stage
setosa     Midwest   early                5
                     late                 6
           Northeast early                2
                     late                 4
           Northwest early                5
                     late                 6
           Southeast early                6
                     late                 6
           Southwest early                5
                     late                 5
versicolor Midwest   early                4
                     late                 7
           Northeast early                8
                     late                 6
           Northwest early                2
                     late                 4
           Southeast early                2
                     late                 4
           Southwest early                6
                     late                 7
virginica  Midwest   early                4
                     late                 6
           Northeast early                7
                     late                 8
           Northwest early                4
                     late                 2
           Southeast early                7
                     late                 1
           Southwest early                8
                     late                 3